app/views/projects/index.html.erb

      <h3><%= p.title %></h3>
        <% p.todos.each do |todo| %>
---
SELECT "todos".* FROM "todos" WHERE "todos"."project_id" = $1  [["project_id", 1]]

    <select name="project_id" id="id" value="exist">
      <% cities_array = Project.all.map { |p| [p.title, p.id] } %>
---
SELECT "projects".* FROM "projects"