app/views/projects/show.html.erb

SELECT "todos".* FROM "todos" WHERE "todos"."project_id" = $1  [["project_id", 1]]
---
<h2>Задачи:</h2>
<% @project.todos.each do |todo| %>