app/views/todos/show.html.erb

<h2>Задачи:</h2>
<% @project.todos.each do |todo| %>
---
SELECT "todos".* FROM "todos" WHERE "todos"."project_id" = $1  [["project_id", 2]]