app/controllers/projects_controller.rb

    def create
        if (params[:project])
            @project = Project.new(title: params[:title])
          	if @project.save
---
INSERT INTO "projects" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Job"], ["created_at", "2018-12-17 13:48:24.626001"], ["updated_at", "2018-12-17 13:48:24.626001"]]

    def update
        @project = Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]