app/controllers/todos_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "todos".* FROM "todos" WHERE "todos"."project_id" = $1  [["project_id", 2]]
---
	def show
		@todo = Todo.find(params[:id])
        @project = Project.where(id: @todo.project_id)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def edit
        @todo = Todo.find(params[:id])

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "todos" ("title", "isComplited", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "выполнить задание 2"], ["isComplited", "f"], ["project_id", 1], ["created_at", "2018-12-17 15:17:22.593411"], ["updated_at", "2018-12-17 15:17:22.593411"]]
---
	def create
    	@project = Project.find(params[:project_id])
    	@todo = @project.todos.create(todo_params)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
UPDATE "todos" SET "title" = $1, "isComplited" = $2, "updated_at" = $3 WHERE "todos"."id" = $4  [["title", "Купить молоко 2л"], ["isComplited", "f"], ["updated_at", "2018-12-18 16:14:28.680027"], ["id", 1]]
---
	def update
		@projects = Project.all
 		@todo = Todo.find(params[:id])

        if @todo.update(todo_params)